angular.module('JusticeApp.services', [])
.service('dataService',['$http','$q',function($http,$q){
	this._httpget = function (url) {
        var deferred = $q.defer();
        $http.get(url)
            .success(function (res) {              
                    deferred.resolve(data);                   
            }).error(function () {
                deferred.reject('There was an error');
            });
        return deferred.promise;
    };
    var BlackIntermediaryData;

    this.getBlackIntermediary=function(){
        return BlackIntermediaryData;
    }
    BlackIntermediaryData=[
    {
        "name": "北京创世恒基"
    },
    {
        "name": "北京诚良建业"
    },
    {
        "name": "北京创世兴业房地产经纪有限公司"
    },
    {
        "name": "北京天目伟业房地产经纪有限公司"
    },
    {
        "name": "北京中房恒汇房地产经纪有限公司"
    },
    {
        "name": "北京天泰置地房地产经纪有限公司"
    },
    {
        "name": "北京佰家房地产经纪有限公司"
    },
    {
        "name": "北京博饰园房地产经纪有限公司"
    },
    {
        "name": "北京佳盛策略房地产经纪有限公司"
    },
    {
        "name": "北京华港房地产经纪有限公司"
    },
    {
        "name": "北京天宏东达房地产经纪有限公司（又称“爱屋及屋”）"
    },
    {
        "name": "北京长丰康盛房地产经济有限公司"
    },
    {
        "name": "北京政通伟业"
    },
    {
        "name": "北京明创"
    },
    {
        "name": "北京中宇房地产经纪有限公司"
    },
    {
        "name": "北京坚石房地产经纪公司"
    },
    {
        "name": "北京恒基无限房地产经纪有限公司"
    },
    {
        "name": "北京柏青兴业房地产经纪有限公司"
    },
    {
        "name": "北京永诚创业房地产经纪有限公司"
    },
    {
        "name": "北京富顺房地产经纪有限公司"
    },
    {
        "name": "北京京宏房地产经纪有限公司"
    },
    {
        "name": "北京东华恒业房地产经纪公司"
    },
    {
        "name": "北京亚太中联房地产经纪有限公司"
    },
    {
        "name": "北京市隆盛达信房地产有限公司"
    },
    {
        "name": "万盛德地产经纪公司"
    },
    {
        "name": "常年房产"
    },
    {
        "name": "东方天鸿"
    },
    {
        "name": "北京金佰佳房地产经纪有限公司"
    },
    {
        "name": "中大恒基"
    },
    {
        "name": "北京风云房地产经纪有限公司"
    },
    {
        "name": "北京市合顺信息咨询部"
    },
    {
        "name": "北京希望房地产经纪有限公司（已更名为“顺驰伟业”）"
    },
    {
        "name": "北京理想之家房地产信息咨询公司（理想之家房地产信息咨询中心）"
    },
    {
        "name": "北京市北环佳苑房地产信息咨询中心"
    },
    {
        "name": "北京旭辉伟业房地产信息咨询中心"
    },
    {
        "name": "北京先锋房地产经纪有限公司"
    },
    {
        "name": "北京龙盛昊达房地产公司"
    },
    {
        "name": "北京万家通胜房地产信息咨询有限公司"
    },
    {
        "name": "北京西庆家园信息咨询中心"
    },
    {
        "name": "北京鸿鑫佳业房地产信息咨询部"
    },
    {
        "name": "北京天翼房地产中介公司"
    },
    {
        "name": "北京君悦行房地产经纪有限公司"
    },
    {
        "name": "北京都市家园房地产经纪有限公司"
    },
    {
        "name": "北京玉麒麟房地产经纪有限公司"
    },
    {
        "name": "北京银佰佳房地产经纪有限公司"
    },
    {
        "name": "北京顺天华宇信息咨询中心"
    },
    {
        "name": "北京中天置地房屋公司"
    },
    {
        "name": "北京手拉手房地产经济公司"
    },
    {
        "name": "天赐中介"
    },
    {
        "name": "北京诚信致远房地产信息咨询有限公司"
    },
    {
        "name": "中天盛世"
    },
    {
        "name": "北京富力天成房地产经纪有限公司"
    },
    {
        "name": "北京久恒伟业房地产经纪有限公司"
    },
    {
        "name": "鸿聚家园房地产经纪公司"
    },
    {
        "name": "北京众鑫伟业房地产经纪有限公司"
    },
    {
        "name": "顺义博爱东兴店"
    },
    {
        "name": "北京顺义博爱房地产经纪有限公司"
    },
    {
        "name": "北京传奇置地"
    },
    {
        "name": "北京恒久置地房地产经纪有限公司"
    },
    {
        "name": "北京天地昊房地产经纪有限公司"
    },
    {
        "name": "北京永昌行房地产经纪有限公司"
    },
    {
        "name": "北京嘉华房地产经纪有限公司"
    },
    {
        "name": "北京金万泉房地产经纪有限公司"
    },
    {
        "name": "北京金有源地产"
    },
    {
        "name": "北京东方红伟房地产经纪有限公司"
    },
    {
        "name": "中伟置地房地产经纪有限公司"
    },
    {
        "name": "海中富"
    },
    {
        "name": "二房东"
    },
    {
        "name": "北京峰辉家园房地产经纪有限公司"
    },
    {
        "name": "北京宏泽置地黑中介"
    },
    {
        "name": "北京雅居恒泰房地产经纪有限公司"
    },
    {
        "name": "北京宏泽置地房地产经纪有限公司 "
    },
    {
        "name": "北京新城卓越房地产经纪有限公司"
    },
    {
        "name": "北京华清泽楷房地产"
    },
    {
        "name": "宏运锦城"
    }
]
}]);

